// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).


// let time = prompt('Введіть число');
// if (time >= 0 && time <= 14) {
//     console.log('Перша частина години');
// } else if (time >= 15 && time <= 29) {
//     console.log('Друга частина години');
// } else if (time >= 30 && time <= 44) {
//     console.log('Третя частина години');
// } else if (time >= 45 && time <= 59) {
//     console.log('Четверта частина години');
// } else {
//     console.log('Невірне число');
// }


// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).


// let day = prompt('Введіть число');
// if (day >= 1 && day <= 10) {
//     console.log('Перша половина місяця');
// } else if (day >= 11 && day <= 20) {
//     console.log('Друга половина місяця');
// } else if (day >= 21 && day <= 31) {
//     console.log('Третя половина місяця');
// } else {
//     console.log('Невірне число');
// }


// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)


// let test = prompt('Введіть значення');
// if (test === true) {
//     console.log('Вірно');
// } else {
//     console.log('Неправильно');
// }


// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3


// let a = prompt('Введіть число');
// if (a != 0) {
//     console.log('Вірно');
// } else {
//     console.log('Невірно');
// }

// let a = 1;
// let test = prompt('Введіть число');
// if (test != 1) {
//     console.log('Вірно');
// } else {
//     console.log('Невірно');
// }

// let a = 0;
// let test = prompt('Введіть число');
// if (test != -3) {
//     console.log('Вірно');
// } else {
//     console.log('Невірно');
// }

// let a = -3;
// let test = prompt('Введіть число');
// if (test != -3) {
//     console.log('Вірно');
// } else {
//     console.log('Невірно');
// }


// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.


// let routine = prompt('Введіть порядковий номер дня тижня');
// switch (routine) {
//     case '1':
//         console.log('Відремонтувати авто');
//         break;
//     case '2':
//         console.log('Піти за продуктами');
//         break;
//     case '3':
//         console.log('Купити телефон');
//         break;
//     case '4':
//         console.log('Відвідати музей');
//         break;
//     case '5':
//         console.log('Поприбирати в квартирі');
//         break;
//     case '6':
//         console.log('Сходити в кіно');
//         break;
//     case '7':
//         console.log('Відпочинок');
//         break;
//     default:
//         console.log('Введене число невірне');
// }


// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.


// let year = prompt('Введіть рік');
// if (year % 4 === 0) {
//     console.log('Цей рік - Високосний');
// } else {
//     console.log('Цей рік - Не Високосний');
// }


// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!


// let name = prompt('Яка офіційна назва JavaScript?');
// if (name === 'ECMAScript') {
//     console.log('Правильно!');
// } else {
//     console.log('Не знаєте? Його назва - ECMAScript!');
// }

