// 1. Створити масив з 10 чисел (можна використовувати Math.random Та Math.floor). Скласти результат цих чисел в змінній result.

// let arr = [ 3, 5, 8, 12, 15, 44, 24, 26, 66, 48];
// let res = arr[4] + [0] + [9] + [6] + [1] + [5] +[7] + [2] + [8] + [3];
// console.log(res);

// 2. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр
// 3. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр, автори
// 4. Створити маис об'єктів book з наступними полями  - назва, кількість сторінок, жанр, автори. Вивести кожну книгу як окремий об'єкт

// let book = {
//     name: 'Енеїда',
//     number: 765,
//     genre: 'поема'
// }
//
// let book2 = {
//     name: 'Кайдашева сімя',
//     number: 533,
//     genre: 'повість',
//     authors: 'Іван Нечуй-Левицький'
// }
//
// let all = [book, book2];
//
// console.log(all[0], all[1]);

// 5. Напишіть код, який вираховує площу прямокутника висотою 23см. (змінна height) та шириною 10см (змінна width).
// Значення площі зберігати в змінній s.

// let height = 23;
// let width = 10;
// let s = height * width;
// console.log(s);

// 6. Напиши код, який знаходить об'єм циліндра заввишки 10м (змінна heightC) та діаметром основи 4м (dC),
// результат помістіть у змінну v.

// let heightC = 10;
// let dC = 4;
// const PI = 3.14;
// let radiusC = dC / 2;
// console.log(radiusC);
// let v = PI * 2**2 * 10;
// console.log(v);

// 7. У прямокутного трикутника дві сторони n (зі значенням 3) та m (зі значенням 4).
// Знайдіть гіпотенузу k за теоремою Піфагора (потрібно використовувати функцію Math.pow (число, ступінь) або оператор зведення в ступінь **).

// let n = 3;
// let n2 = 3;
// let m = 4;
// let k = Math.sqrt(n ** 2 + m ** 2);
// console.log(k);
